src/InformationRegisters/SSL_IT_РасположенияМетодов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>SSL_IT_РасположенияМетодов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Расположение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.SSL_IT_ВариантыРасположенияМетодов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИмяМетода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/SSL_IT_ВидыСоединений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>SSL_IT_ВидыСоединений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>HTTPСервис</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WebСервис</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/SSL_IT_РезультатыВыполненияЗапроса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>SSL_IT_РезультатыВыполненияЗапроса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выборка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выгрузка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/SSL_IT_ВариантыРасположенияМетодов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>SSL_IT_ВариантыРасположенияМетодов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МодульОбмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодключаемаяОбработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МодульОбменаИлиПодключаемаяОбработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодключаемаяОбработкаИлиМодульОбмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отсутствует</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/SSL_IT_ПараметрыСоединений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>SSL_IT_ПараметрыСоединений</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.SSL_IT_ВидыСоединений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АутентификацияОС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Таймаут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФункции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/SSL_IT_УниверсальныйОбменПовтИсп/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция НайтиСформироватьСтруктуруСоединения(ЗначениеПоиска, ПараметрПоиска = "Ключ") Экспорт
	
	Если ТипЗнч(ЗначениеПоиска) = Тип("СправочникСсылка.SSL_IT_ПараметрыСоединений") Тогда 
		ПараметрПоиска = "Ссылка";
	КонецЕсли;	
	
	СхемаЗапроса = SSL_IT_СхемыЗапросов.ПолучитьСхемуЗапроса(
		"ВЫБРАТЬ
		|	SSL_IT_ПараметрыСоединений.Ссылка КАК ПараметрыСоединения,
		|	SSL_IT_ПараметрыСоединений.Наименование КАК Наименование,
		|	SSL_IT_ПараметрыСоединений.Ключ КАК Ключ,
		|	SSL_IT_ПараметрыСоединений.Вид КАК Вид,
		|	SSL_IT_ПараметрыСоединений.Сервер КАК Сервер,
		|	SSL_IT_ПараметрыСоединений.Порт КАК Порт,
		|	SSL_IT_ПараметрыСоединений.Логин КАК Логин,
		|	SSL_IT_ПараметрыСоединений.Пароль КАК Пароль,
		|	SSL_IT_ПараметрыСоединений.ИмяБазы КАК ИмяБазы,
		|	SSL_IT_ПараметрыСоединений.ИмяСервиса КАК ИмяСервиса,
		|	SSL_IT_ПараметрыСоединений.ИмяФункции КАК ИмяФункции,
		|	SSL_IT_ПараметрыСоединений.АутентификацияОС КАК АутентификацияОС,
		|	SSL_IT_ПараметрыСоединений.Таймаут КАК Таймаут
		|ИЗ
		|	Справочник.SSL_IT_ПараметрыСоединений КАК SSL_IT_ПараметрыСоединений
		|ГДЕ
		|	НЕ SSL_IT_ПараметрыСоединений.ПометкаУдаления
		|	И НЕ SSL_IT_ПараметрыСоединений.ЭтоГруппа");
	
	SSL_IT_СхемыЗапросов.ДобавитьУсловие(
		СтрШаблон("SSL_IT_ПараметрыСоединений.%1 = &ЗначениеПоиска", ПараметрПоиска),,, СхемаЗапроса);	
	ЗапросПараметров = Новый Запрос(СхемаЗапроса.ПолучитьТекстЗапроса());
	ЗапросПараметров.УстановитьПараметр("ЗначениеПоиска", ЗначениеПоиска);
	РезультатЗапроса = ЗапросПараметров.Выполнить();	
	ВыборкаПараметров = РезультатЗапроса.Выбрать();	
		
	Если ВыборкаПараметров.Следующий() Тогда 
		СтруктураСоединения = СформироватьСтруктуруСоединения(ВыборкаПараметров);
	Иначе
		СтруктураСоединения = Неопределено;	
	КонецЕсли;	
	
	// Возврат
	Возврат СтруктураСоединения;
	
КонецФункции

Функция СформироватьСтруктуруСоединения(ПараметрыСоединения) Экспорт 
	
	СтруктураСоединения = Новый Структура("Соединение");
	
	Если ПараметрыСоединения.Вид = Перечисления.SSL_IT_ВидыСоединений.HTTPСервис Тогда 
		СтруктураСоединения.Соединение = SSL_IT_HTTPСервисы.СформироватьСоединение(
			ПараметрыСоединения.Сервер,
			ПараметрыСоединения.Порт,
			ПараметрыСоединения.Логин,
			ПараметрыСоединения.Пароль,
			ПараметрыСоединения.Таймаут,
			Новый ЗащищенноеСоединениеOpenSSL(),
			ПараметрыСоединения.АутентификацияОС);
			
		СтруктураСоединения.Вставить("ИмяБазы", ПараметрыСоединения.ИмяБазы); 
	КонецЕсли;		
	
	// Возврат
	Возврат СтруктураСоединения;
	
КонецФункции

Функция ОпределитьРасположениеМетода(ИмяМетода) Экспорт
	
	ВыборкаРасположения = SSL_IT_Запросы.СформироватьВыполнитьЗапрос(	
		"ВЫБРАТЬ
		|	ЕСТЬNULL(SSL_IT_РасположенияМетодов.Расположение, SSL_IT_РасположениеМетодовПоУмолчанию.Значение) КАК Расположение,
		|	ЕСТЬNULL(SSL_IT_РасположенияМетодов.КлючОбработки, """") КАК КлючОбработки
		|ИЗ
		|	Константа.SSL_IT_РасположениеМетодовПоУмолчанию КАК SSL_IT_РасположениеМетодовПоУмолчанию
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.SSL_IT_РасположенияМетодов КАК SSL_IT_РасположенияМетодов
		|		ПО (SSL_IT_РасположенияМетодов.ИмяМетода = &ИмяМетода)",,
		Новый Структура("ИмяМетода", ИмяМетода),,
		Перечисления.SSL_IT_РезультатыВыполненияЗапроса.Выборка);
	РасположениеМетода = Новый Структура("Расположение,КлючОбработки", Перечисления.SSL_IT_ВариантыРасположенияМетодов.МодульОбмена);
	
	Если ВыборкаРасположения.Следующий() Тогда 
		ЗаполнитьЗначенияСвойств(РасположениеМетода, ВыборкаРасположения);
	КонецЕсли;
	
	// Возврат
	Возврат РасположениеМетода;
	
КонецФункции	

#КонецОбласти
